'''
print("ім\'я:\tІван \nпрізв.:\tІванов")
message = input('Введіть повідомлення: ')
print('Ваше повідомлення:', message, '...')
print('Ваще повідомлення:' + message + '...')
print(f'Ваще повідомлення: {message}...')
'''

'''
 str – рядок
 int - ціле число
 float - дійсне число
'''

a = int(input('Введіть перше число: '))
b = int(input('Введіть друге число: '))

print(a + b)
print(a, '-', b, '=', a - b)
print(f'{a} * {b} = {a * b}')
print(f'{a} / {b} = {a / b}')

'''

    Переписати код зверху. Додати дії: - (мінус), * (помножити), / (поділити)
    
    Наприклад:
    
    Введіть перше число: 8
    Введіть друге число: 2
    
    8 + 2 = 10
    8 - 2 = 6
    8 * 2 = 16
    8 / 2 = 4.0
'''
