from aiogram.fsm.state import StatesGroup, State


class SumStates(StatesGroup):
    first_number = State()
    second_number = State()


class ButtonStates(StatesGroup):
    choose_button = State()


'''
    Переробити бота таким чином, щоб при
    введенні команди /calc у користувача
    запитувалися числа і дія, яку треба
    з ними виконати (+, -, *, /).
    
    Введені числа та операцію перевіряти
    на коректність.

'''
'''

    Зробити команду /counter, яка виведе
    повідомлення-лічильник. Наприклад:
    
    Поточне значення: 0
    
    У цього повідомлення має бути 3 кнопки:
    +1, -1 та Видалити.
    
    Натискання кнопок +1 та -1 має змінювати
    значення в повідомленні. Натискання кнопки
    Видалити видаляє повідомлення з лічильником.
    Або замінює його на повідомлення
    "Лічильник видалено".

'''